TEST_CASE/BW/All/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  28;

method          scotch; //hierarchical; //scotch;

//coeffs
//{
  //  n           (2 2 2);//(3 3 3);
//}


hierarchicalCoeffs
{
    n               ( 3 3 3 );
    delta           0.001;
    order           xyz;
}
// ************************************************************************* //
